Revit 2015 API
UnitFormatUtils.FormatValueToString Method
Overload List
Name | Description
FormatValueToString(Units, UnitType, Double, Boolean, Boolean) |  Obsolete.
 Formats a number with units into a string.
FormatValueToString(Units, UnitType, Double, Boolean, Boolean, FormatValueOptions) |  Obsolete.
 Formats a number with units into a string.
See Also
UnitFormatUtils Class
UnitFormatUtils Members
Autodesk.Revit.DB Namespace